learn how we use sort_index() and set_index() and reset_index()

In [21]:
# from datasets import load_dataset
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# import data
df = pd.read_csv("/goinfre/hrami/python_for_data/data_jobs.csv")

# data cleanup
df['job_posted_date'] = pd.to_datetime(df.job_posted_date)

df.index.name = 'job_index'

reset_index()

In [ ]:
usa_job = df[df['job_country'] == 'United States']
usa_job.reset_index(inplace=True)
usa_job.head(10)

set_index()

In [ ]:
usa_job.set_index('job_index' ,inplace=True)
usa_job

In [ ]:
table_us = usa_job.pivot_table(values='salary_year_avg', index='job_title_short', aggfunc=['median', 'max', 'min'])
table_us

In [40]:
table_us.sort_index(inplace=True)
table_us

                                   median             max             min
                          salary_year_avg salary_year_avg salary_year_avg
job_title_short
Business Analyst                  90000.0        387460.0         35000.0
Cloud Engineer                   116100.0        221844.0         42000.0
Data Analyst                      90000.0        375000.0         25000.0
Data Engineer                    125000.0        525000.0         23496.0
Data Scientist                   130000.0        960000.0         30000.0
Machine Learning Engineer        150000.0        315000.0         44408.5
Senior Data Analyst              110000.0        425000.0         35360.0
Senior Data Engineer             150000.0        375000.0         45000.0
Senior Data Scientist            155000.0        475000.0         55000.0
Software Engineer                130000.0        375000.0         48982.0